Masmiseim36/iMXRT/targets/iMXRT/Loader2/iMXRT600/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexSPI0BPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitQuadSPIPins (void)
{
    GPIO_PortInit (GPIO, 1);
    GPIO_PortInit (GPIO, 2);
        /* Define the init structure for the reset pin*/
    gpio_pin_config_t reset_config = {
        kGPIO_DigitalOutput,
        1,
    };
    GPIO_PinInit  (GPIO, 2, 12, &reset_config);

    const uint32_t port1_pin11_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA0 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT1 PIN11 (coords: L2) is configured as FLEXSPI0B_DATA0 */
    IOPCTL_PinMuxSet(IOPCTL, 1U, 11U, port1_pin11_config);

    const uint32_t port1_pin12_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA1 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT1 PIN12 (coords: M2) is configured as FLEXSPI0B_DATA1 */
    IOPCTL_PinMuxSet(IOPCTL, 1U, 12U, port1_pin12_config);

    const uint32_t port1_pin13_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA2 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT1 PIN13 (coords: N1) is configured as FLEXSPI0B_DATA2 */
    IOPCTL_PinMuxSet(IOPCTL, 1U, 13U, port1_pin13_config);

    const uint32_t port1_pin14_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA3 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT1 PIN14 (coords: N2) is configured as FLEXSPI0B_DATA3 */
    IOPCTL_PinMuxSet(IOPCTL, 1U, 14U, port1_pin14_config);

    const uint32_t port1_pin29_config = (IOPCTL_PIO_FUNC5 |			/* Pin is configured as FLEXSPI0B_SCLK */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |	/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT1 PIN29 (coords: U3) is configured as FLEXSPI0B_SCLK */
    IOPCTL_PinMuxSet(IOPCTL, 1U, 29U, port1_pin29_config);

    const uint32_t port2_pin12_config = (IOPCTL_PIO_FUNC0 |			/* Pin is configured as PIO2_12 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_DI |		/* Disable input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_DI |	/* Normal drive */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN12 (coords: T3) is configured as PIO2_12 */	// MK: Reset Signal
    IOPCTL_PinMuxSet(IOPCTL, 2U, 12U, port2_pin12_config);
}

void BOARD_InitOctaSPIPins (void)
{
    const uint32_t port2_pin17_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA4 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN17 (coords: U1) is configured as FLEXSPI0B_DATA4 */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 17U, port2_pin17_config);

    const uint32_t port2_pin18_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA5 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN18 (coords: R2) is configured as FLEXSPI0B_DATA5 */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 18U, port2_pin18_config);

