Masmiseim36/iMXRT/targets/iMXRT/Loader2/iMXRT600/pin_mux.c
    const uint32_t port2_pin19_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_SS0_N */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN19 (coords: T2) is configured as FLEXSPI0B_SS0_N */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 19U, port2_pin19_config);

    const uint32_t port2_pin22_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA6 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |	/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN22 (coords: P3) is configured as FLEXSPI0B_DATA6 */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 22U, port2_pin22_config);

    const uint32_t port2_pin23_config = (IOPCTL_PIO_FUNC6 |			/* Pin is configured as FLEXSPI0B_DATA7 */
                                         IOPCTL_PIO_PUPD_DI |		/* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |	/* Enable pull-down function */
                                         IOPCTL_PIO_INBUF_EN |		/* Enables input buffer function */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |	/* Normal mode */
                                         IOPCTL_PIO_FULLDRIVE_EN |	/* Full drive enable */
                                         IOPCTL_PIO_ANAMUX_DI |		/* Analog mux is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |	/* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_INV_DI);		/* Input function is not inverted */
    /* PORT2 PIN23 (coords: P5) is configured as FLEXSPI0B_DATA7 */
    IOPCTL_PinMuxSet(IOPCTL, 2U, 23U, port2_pin23_config);

    BOARD_InitQuadSPIPins ();
}

void BOARD_PerformJEDECReset (void)
{
	const uint32_t GpioConfig = IOPCTL_PIO_FUNC0 |				/* Pin is configured as PIO2_12 */
                                IOPCTL_PIO_PUPD_DI |			/* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |		/* Enable pull-down function */
                                IOPCTL_PIO_INBUF_DI |			/* Disable input buffer function */
                                IOPCTL_PIO_SLEW_RATE_NORMAL |	/* Normal mode */
                                IOPCTL_PIO_FULLDRIVE_DI |		/* Normal drive */
                                IOPCTL_PIO_ANAMUX_DI |			/* Analog mux is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |		/* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_INV_DI;				/* Input function is not inverted */


	GPIO_PortInit (GPIO, 1);
	GPIO_PortInit (GPIO, 2);

	IOPCTL_PinMuxSet(IOPCTL, 2U, 19U, GpioConfig);	// SS0
	IOPCTL_PinMuxSet(IOPCTL, 1U, 11U, GpioConfig);	// Data0
	IOPCTL_PinMuxSet(IOPCTL, 1U, 29U, GpioConfig);	// CLK

	// Set the direction of 3 pins used in JEDEC reset to output
    gpio_pin_config_t jreset_pin_config = {kGPIO_DigitalOutput, 1};
	GPIO_PinInit (GPIO, 2U, 19U, &jreset_pin_config); // CS
	GPIO_PinInit (GPIO, 1U, 11U, &jreset_pin_config); // SI/IO0
	GPIO_PinInit (GPIO, 1U, 29U, &jreset_pin_config); // SCK

	// Perform a reset sequence:
	// CS goes low 4 times with alternating values of SOUT
	// SCK is drive low or high and must stay in one state
	GPIO_PinWrite (GPIO, 1U, 29U, 0); // set SCK low
	for (uint32_t i = 0; i < 4; i++)
	{
		// drive CS low
		GPIO_PinWrite (GPIO, 2U, 19U, 0);
		for (int j=0; j<100; j++);
		// drive SI low or high: alternate its state every iteration
		GPIO_PinWrite (GPIO, 1U, 11U, (i&1));
		// drive CS high; SI state will be captured on the CS rising edge
		GPIO_PinWrite (GPIO, 2U, 19U, 1);
		for (int j=0; j<100; j++)
			;
	}
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/


